//Перепроектировать структуру, созданную при выполнении лабораторной работы №7(по выбранной предметной области), так, 
//чтобы одно из информационных полей, содержащих характеристику группы объектов(издательство, модель, тип и т.п.), 
//стало ссылкой на элемент двусвязного линейного списка  и выполнить задание в соответствии с вариантом.

//Разработать подалгоритм вывода значений заданного информационного поля элементов двусвязного списка в прямом или обратном направлении 
//по желанию пользователя с одновременным удалением последнего выводимого на экран элемента.

#include <stdio.h>
#include "Struct.h"
#include "ReadInStruct.h"

int main()
{
	PROCESSOR_STRUCT* processor = NULL;

	processor = addInSruct(processor);



	return 0;
}